config.org
#+TITLE: Malac0da's GNU Emacs Config
#+AUTHOR: Matthew Rafei
#+DESCRIPTION: Personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* IMPORTANT PROGRAMS TO LOAD FIRST

** Elpaca Package Manager
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo)) ;
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install a package via the elpaca macro
  ;; See the "recipes" section of the manual for more details.

  ;; (elpaca example-package)

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode))

  ;;When installing a package used in the init file itself,
  ;;e.g. a package which adds a use-package key word,
  ;;use the :wait recipe keyword to block until that package is installed/configured.
  ;;For example:
  ;;(use-package general :ensure (:wait t) :demand t)

  ;; Expands to: (elpaca evil (use-package evil :demand t))
  ;; (use-package evil :ensure t :demand t)

  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause evaluate the declaration immediately. It is not deferred.
  ;;Useful for configuring built-in emacs features.
  (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))
#+end_src

** Which-key
#+begin_src emacs-lisp
  (use-package which-key
    :init
    (which-key-mode 1)
    :config
    (setq which-key-side-window-location 'bottom
  	which-key-sort-order #'which-key-key-order-alpha
  	which-key-sort-uppercase-first nil
  	which-key-add-column-padding 1
  	which-key-max-display-columns nil
  	which-key-min-display-lines 6
  	which-key-side-window-slot -10
  	which-key-side-window-max-height 0.25
  	which-key-idle-delay 0.8
  	which-key-max-description-length 25
  	which-key-allow-imprecise-window-fit t
  	which-key-separator " → " ))
#+end_src

** Load Theme
#+begin_src emacs-lisp
  (use-package dracula-theme
    :ensure t
    :config (load-theme 'dracula t))
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :config (projectile-mode +1))
#+end_src

** Ido
#+begin_src emacs-lisp
  (ido-mode 1)
  (ido-everywhere 1)
#+end_src

** VTerm
#+begin_src emacs-lisp
  (use-package vterm
    :ensure t)
#+end_src

** Dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    ;; Enable the dashboard
    (dashboard-setup-startup-hook)
    (setq dashboard-startup-banner "~/.config/emacs/emacs.png")
    (setq dashboard-banner-logo-title "Welcome to EMACS")
    (setq dashboard-footer-messages '("People never quit Emacs; they just die at some point."))
    (setq dashboard-items nil)
  )
#+end_src

* GENERAL CHANGES

** Org-tempo 
#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src

** Change Font
#+begin_src emacs-lisp
  (cond
   ((find-font (font-spec :name "Iosevka Extended"))
    (set-frame-font "Iosevka Extended 11" nil t)))
#+end_src

** Change Compile command behavior
#+begin_src emacs-lisp
  (setq display-buffer-alist
        '(("\\*compilation\\*"
           (display-buffer-same-window))))
#+end_src

** Disable menubar, toolbars and scrollbars
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

** Display line numbers and truncated lines
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+end_src

** Simple C-Mode for Emacs
#+begin_src emacs-lisp
  ;; Adding `/path/to/simpc` to load-path so `require` can find it
  (add-to-list 'load-path "~/.config/emacs/simpc-mode")
  ;; Importing simpc-mode
  (require 'simpc-mode)
  ;; Automatically enabling simpc-mode on files with extensions like .h, .c, .cpp, .hpp
  (add-to-list 'auto-mode-alist '("\\.[hc]\\(pp\\)?\\'" . simpc-mode))
#+end_src

** Open Man pages on current buffer
#+begin_src emacs-lisp
  (setq Man-notify-method 'pushy)
#+end_src

* Keybinds

** Set compile keybind
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c c") 'compile)
#+end_src

** Swap window-swap-state
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c s") 'window-swap-states)
#+end_src

** Switch to compile buffer
#+begin_src emacs-lisp
  (defun switch-to-compilation-buffer ()
  "Switch to the *compilation* buffer if it exists."
  (interactive)
  (let ((buf (get-buffer "*compilation*")))
    (if buf
        (switch-to-buffer buf)
      (message "Compilation buffer does not exist"))))

  (global-set-key (kbd "C-<tab>") 'switch-to-compilation-buffer)
#+end_src

** Kill all other windows
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x m") 'delete-other-windows)
#+end_src
